---
kind: property
id: P:Autodesk.Revit.DB.FamilyTypeSet.IsEmpty
source: html/ad6a026a-d6e3-d1f4-d26b-330249560756.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.